In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':["B0","B1","B2",'B3'],
                  'C':['C0','C1',"C2","C3"],
                  'D':["D0",'D1',"D2",'D3']})

In [3]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ["B4", "B5", "B6", 'B7'],
                    'C': ['C4', 'C5', "C6", "C7"],
                    'D': ["D4", 'D5', "D6", 'D7']}, index=[4, 5, 6, 7])

In [4]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ["B8", "B9", "B10", 'B11'],
                    'C': ['C8', 'C9', "C10", "C11"],
                    'D': ["D8", 'D9', "D10", 'D11']}, index=[8, 9, 10, 11])

In [5]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

# Cancatenating Dataframe

combine the dataframes

In [6]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [7]:
df4=pd.DataFrame({'A':[2,3,4],'E':[4,5,6]},)

In [8]:
df4.shape

(3, 2)

In [9]:
df2.shape

(4, 4)

In [10]:
pd.concat([df1,df2,df4],axis=0)

/home/jiss/.local/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    A    B    C    D    E
0  A0   B0   C0   D0  NaN
1  A1   B1   C1   D1  NaN
2  A2   B2   C2   D2  NaN
3  A3   B3   C3   D3  NaN
4  A4   B4   C4   D4  NaN
5  A5   B5   C5   D5  NaN
6  A6   B6   C6   D6  NaN
7  A7   B7   C7   D7  NaN
0   2  NaN  NaN  NaN  4.0
1   3  NaN  NaN  NaN  5.0
2   4  NaN  NaN  NaN  6.0

here v concatenate dataframes by columns wise since axis is set to 0

In [11]:
sample_df = pd.DataFrame({'cars': ['honda', 'city', 'baleno'],
                          'engine': [100, 200, 40],

                          "petrol/diesel": ['yes', "no", 'yes']})

In [12]:
sample_df2 = pd.DataFrame({'cars': ["suzuki", 'santro'],
                           'engine': [300, 100],
                           'petrol/diesel': ["yes", 'no'],
                           })

In [13]:
sample_df

     cars  engine petrol/diesel
0   honda     100           yes
1    city     200            no
2  baleno      40           yes

In [14]:
sample_df2

     cars  engine petrol/diesel
0  suzuki     300           yes
1  santro     100            no

In [15]:
new_df=pd.concat([sample_df,sample_df2])
new_df

     cars  engine petrol/diesel
0   honda     100           yes
1    city     200            no
2  baleno      40           yes
0  suzuki     300           yes
1  santro     100            no

In [16]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [17]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [18]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

# Merging
    
    
The merge function allows you to merge DataFrames together using INNER JOIN logic of SQL

ie here v merge two dataframe based on a same column 'key' in both

In [19]:
pd.merge(left,right)

#

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [20]:
pd.merge(left,right,how='inner',on='key')

# on paramter need to specify based on which column merging is to be done

# inner: use intersection of keys from both frames, similar to a SQL inner
#       join; preserve the order of the left keys.

# also default inner is the default arg of how paramater

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [21]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [22]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [23]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [24]:
pd.merge(left,right)

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

# Joining dataframes

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [25]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [26]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [30]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [31]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [32]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [34]:
left.join(right)

# here v do join of tw dataframes based on the index labels .
# default it does the left join means all the datas in the left dataframe will be in the new dataframe.
# and index in right dataframe that also comes in left dataframe will be there in new dataframe
# all other index that r not in both dataframes r ignored.

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [35]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [38]:
left.join(right,how='inner')

# here v doed the inner join of both.
# so the index appers in the both r shown

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

**Exercise**

Concatenating

In [39]:
data1=pd.DataFrame({'student_names':['arun','adharsh','ajith'],"marks":[34,56,78]})
data2=pd.DataFrame({'student_names':['jiss','justin','charles'],"marks":[79,46,58]},index=[3,4,5])

In [40]:
pd.concat([data1,data2])

  student_names  marks
0          arun     34
1       adharsh     56
2         ajith     78
3          jiss     79
4        justin     46
5       charles     58

Merging

In [44]:
data1=pd.DataFrame({'student_names':['arun','adharsh','ajith'],"marks":[34,56,78],'course':['bca','bcom','bca']})
data2=pd.DataFrame({'student_names':['jiss','justin','charles'],"marks":[79,46,58],'course':['mtech','bca','btech']},index=[3,4,5])

In [47]:
data1.merge(data2,on='course',how='left')

  student_names_x  marks_x course student_names_y  marks_y
0            arun       34    bca          justin     46.0
1         adharsh       56   bcom             NaN      NaN
2           ajith       78    bca          justin     46.0

Joining

In [54]:
data1=pd.DataFrame({'student_names':['arun','adharsh','ajith'],"marks":[34,56,78]},index=['h1','h2','h3'])
data2=pd.DataFrame({'course':['bca','bcom','btech'],"grades":[
    "A",'B','D']},index=["h2",'h3','h4'])

In [55]:
data1.join(data2)

   student_names  marks course grades
h1          arun     34    NaN    NaN
h2       adharsh     56    bca      A
h3         ajith     78   bcom      B

In [56]:
data1

   student_names  marks
h1          arun     34
h2       adharsh     56
h3         ajith     78

In [57]:
data2

   course grades
h2    bca      A
h3   bcom      B
h4  btech      D